Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolygonFace_t
DO NOT USE! For internal usage only!

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolygonFace_t.nPoints
The number of points.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolygonFace_t.aPoints
The points.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolygonFace_t.Color
DO NOT USE! For internal usage only!

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolygonFace_t.Id
DO NOT USE! For internal usage only!

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolygonFace_t.SubId
DO NOT USE! For internal usage only!

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolygonFace_t.ViewId
The view identifier.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolygonFace_t.DrawToFrontBuffer
Indicates whether the face should be drawn on top of everything else.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolygonFace_t.DrawAsDetail
Indicates whether the face should be drawn on top of coplanar faces
(a little towards the camera).

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolygonFace_t.DrawLightingEffect
Indicates whether to draw the lighting effect.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolygonFace_t.DrawDoubleSided
Indicates whether to draw the face as double sided.